Autodesk.Revit.DB.Structure.StructuralSettings.SetValuesForLoadsDisplayScaling(System.Double,System.Double,System.Double,System.Double)
Sets values for loads display scaling by providing two load forces and their corresponding length of the representative lines in internal units.
Remarks:
Use UnitUtils class methods to convert value from or to internal units.
The values are used to scale the representation of all load types(point, line and area loads).
minimumLoadValue:
The minimum force in SpecTypeId.Force units.
minimumForceLineLength:
The line length for minimum force.
maximumLoadValue:
The maximum force in SpecTypeId.Force units.
maximumForceLineLength:
The line length for maximum force.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when:
- forces are negative.
- line lengths are negative.
- minimum force is greater or equal to the maximum force.
- line length for minimum force is greater than line length for maximum force.
Since:
2024

Autodesk.Revit.DB.Structure.StructuralSettings.GetLoadForceVectorReprLine(Autodesk.Revit.DB.Structure.LoadType,Autodesk.Revit.DB.XYZ)
Returns the representative line of the load force vector according to loads display scaling.
loadType:
LoadType::Point, Line, or Area
forceVector:
The load force vector in internal units.
Returns:
The the representative line in internal units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.StructuralSettings.GetStructuralSettings(Autodesk.Revit.DB.Document)
Obtains the StructuralSettings object for the specified project document.
doc:
A project document.
Returns:
The StructuralSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.UseLoadsDisplayScaling
Whether to use loads display scaling. If disabled then loads are displayed according to force scale type parameters.
Since:
2024

Autodesk.Revit.DB.Structure.StructuralSettings.ShowBraceBelow
Whether to show brace symbols below beams in plan views.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.ShowBraceAbove
Whether to show brace symbols above beams in plan views.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolUserDefined
The id of the FamilySymbol to represent a user-defined boundary condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolRoller
The id of the FamilySymbol to represent a roller boundary condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolPinned
The id of the FamilySymbol to represent a pinned boundary condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolFixed
The id of the FamilySymbol to represent a fixed boundary condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.KickerBraceSymbol
The id of the ElementType to represent a kicker brace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BraceBelowSymbol
The id of the ElementType to represent a brace below a beam in plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BraceAboveSymbol
The id of the ElementType to represent a brace above a beam in plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionAreaAndLineSymbolSpacing
Symbol spacing for boundary conditions.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.SymbolicCutbackForColumn
Symbolic cutback distance to be applied to all columns.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.SymbolicCutbackForBrace
Symbolic cutback distance to be applied to all braces.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.SymbolicCutbackForBeamAndTruss
Symbolic cutback distance to be applied to all beams and trusses.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BraceParallelLineOffset
The distance by which brace symbols in plan
views will be offset.
Remarks:
Applies only when BracePlanRepresentation is set to ParallelLine.
Since:
2011